/**
 * 
 */
package com.navigation.domain;

import java.util.HashMap;
import java.util.Map;

/**
 * @author wanghui2
 * @date 2011-3-21
 */
public class GewaraConstant {

	private Map<Integer,String> placeMap = new HashMap<Integer, String>(){{
		put(4, 		"42,国泰电影院");
		put(6, 		"40,万裕国际影城");
		put(5360, 	"43,兰生影剧院");
		put(9, 		"41,UME新天地国际影城");
		put(4699299,"45,上海博纳银兴国际影城");
		put(3298455,"47,金逸国际电影城中环店");
		put(250349,	"44,上海中环放电影院");
		put(5368, 	"48,新上海影都");
		put(23909137,"52,青浦永乐国际影城");
		put(20631056,"51,上海青浦影城");
		put(1274909, "37,上海梅陇文化馆");
		put(18, 	"34,新衡山电影院");
		put(5, 		"36,西南影城");
		put(10, 	"33,上海永华电影城");
		put(13, 	"1,柯达电影世界");
		put(1262544,"21,上海庆春电影城");
		put(5366, 	"55,上影CGV大宁影城");
		put(572327, "56,沪北电影院");
		put(1262542,"54,崇明影剧院");
		put(1268136,"66,上海宝山文化馆影剧院");
		put(1543238,"65,大地数字影院-大华影院");
		put(8, 		"67,大地数字影院-弘基广场");
		put(15, 	"74,环艺电影城");
		put(5365, 	"23,上海世纪友谊影城");
		put(1351080,"62,大地数字影院梅陇新都会");
		put(513495, "59,上影CGV莘庄影城");
		put(24401091,"63,七宝大光明影城");
		put(19518602,"70,上海星美国际影城金山店");
		put(20602186,"71,朱泾大光明影城");
		put(1, 		"20,大光明电影院");
		put(2, 		"75,和平影都");
		put(5341, 	"77,新世界电影城");
		put(242574, "76,世纪大上海电影院");
		put(32259515,"84,上海左岸国际影城");
		put(248026, "82,上海开元地中海影城");
		put(1253468,"83,上海星美乐莫国际影城");
		put(26647682,"92,上海国金百丽宫影院");
		put(16027726,"94,中影国际影城");
		put(2088696, "91,上海周浦万达国际影城");
		put(11, 	"90,新世纪影城");
		put(710347, "95,川沙影剧院");
		put(12, 	"89,上海星美正大影城");
		put(3774380,"93,世博国际影城");
		put(5362, 	"86,曲阳影都");
		put(1277473,"22,上海星美国际影城虹口店");
		put(242732, "87,上海群众影剧院");
		put(372763, "96,上海嘉定影剧院");
		put(1543078,"97,大地数字影院-罗宾森广场");
		put(579510, "99,南桥电影院");
		put(22215793,"98,南桥海上国际影城");
		put(17, 	"30,天山电影院");
		put(16, 	"28,龙之梦影城");
		put(5340, 	"27,上海虹桥世纪影城");
		put(3873903,"31,万裕国际影城(虹桥店)");
		put(10236977,"100,大地数字影院南汇乐购");
		put(7, 		"103,上海又一城放电影院");
		put(7095, 	"104,四平电影院");
		put(63364, 	"102,上海万达国际影城");
		put(5361, 	"46,曹杨影城");
		put(37545712,"64,上海乐虹坊影城");
		put(14, 	"29,上海影城");
		put(5364, 	"32,上海世纪仙霞影城");
		put(3, 		"78,浙江电影院");
		put(317469, "49,上海沪西电影院");
		put(572372, "57,星火影剧院");
		put(1262539,"101,东方电影院");
		put(331367, "79,黄浦剧场");
		put(0, 		",");
		put(0, 		",");
	}};

	public Map<Integer, String> getPlaceMap() {
		return placeMap;
	}

	public void setPlaceMap(Map<Integer, String> placeMap) {
		this.placeMap = placeMap;
	}

}
